"""

python3 core8/pwb.py make2/fix/test_mv_year

"""

from . import mv_years
from .. import printe

mv_years.print_test = printe.output

textx = """
    عقد 2020 في مجتمع في مدريد
    عقد 2020 في الرياضة في يوتا
    عقد 2020 في الرياضة في ويسكونسن
    عقد 2020 في الرياضة في ولاية واشنطن
    عقد 2020 في الرياضة في ولاية نيويورك
    عقد 2020 في الرياضة في ولاية جورجيا
    عقد 2020 في الرياضة في وايومنغ
    عقد 2020 في الرياضة في نيومكسيكو
    عقد 2020 في الرياضة في نيوجيرسي
    عقد 2020 في الرياضة في نيفادا
    عقد 2020 في الرياضة في نبراسكا
    عقد 2020 في الرياضة في مينيسوتا
    عقد 2020 في الرياضة في ميشيغان
    عقد 2020 في الرياضة في ميزوري
    عقد 2020 في الرياضة في مسيسيبي
    عقد 2020 في الرياضة في مدينة نيويورك
    عقد 2020 في الرياضة في ماساتشوستس
    عقد 2020 في الرياضة في ماريلند
    عقد 2020 في الرياضة في لويزيانا
    عقد 2020 في الرياضة في كونيتيكت
    عقد 2020 في الرياضة في كولورادو
    عقد 2020 في الرياضة في كنتاكي
    عقد 2020 في الرياضة في كانساس
    عقد 2020 في الرياضة في كاليفورنيا
    عقد 2020 في الرياضة في كارولاينا الشمالية
    عقد 2020 في الرياضة في فلوريدا
    عقد 2020 في الرياضة في فرجينيا
    عقد 2020 في الرياضة في رود آيلاند
    عقد 2020 في الرياضة في تينيسي
    عقد 2020 في الرياضة في تكساس
    عقد 2020 في الرياضة في بنسيلفانيا
    عقد 2020 في الرياضة في إنديانا
    عقد 2020 في الرياضة في إلينوي
    عقد 2020 في الرياضة في أيداهو
    عقد 2020 في الرياضة في أوهايو
    عقد 2020 في الرياضة في أوكلاهوما
    عقد 2020 في الرياضة في أوريغن
    عقد 2020 في الرياضة في ألاباما
    عقد 2020 في الرياضة في أريزونا
    عقد 2020 في الرياضة في آيوا
    عقد 2020 في ألعاب رياضية في إلينوي
    عقد 2020 في ألعاب رياضية في أركنساس
    القرن 21 في الرياضة في يوتا
    القرن 21 في الرياضة في ويسكونسن
    القرن 21 في الرياضة في ولاية واشنطن
    القرن 21 في الرياضة في ولاية نيويورك
    القرن 21 في الرياضة في نيومكسيكو
    القرن 21 في الرياضة في نيوجيرسي
    القرن 21 في الرياضة في نيفادا
    القرن 21 في الرياضة في مينيسوتا
    القرن 21 في الرياضة في ميشيغان
    القرن 21 في الرياضة في ميزوري
    القرن 21 في الرياضة في مدينة نيويورك
    القرن 21 في الرياضة في ماساتشوستس
    القرن 21 في الرياضة في لويزيانا
    القرن 21 في الرياضة في كونيتيكت
    القرن 21 في الرياضة في كولورادو
    القرن 21 في الرياضة في كنتاكي
    القرن 21 في الرياضة في كانساس
    القرن 21 في الرياضة في كاليفورنيا
    القرن 21 في الرياضة في فلوريدا
    القرن 21 في الرياضة في فرجينيا
    القرن 21 في الرياضة في تينيسي
    القرن 21 في الرياضة في تكساس
    القرن 21 في الرياضة في بنسيلفانيا
    القرن 21 في الرياضة في إنديانا
    القرن 21 في الرياضة في إلينوي
    القرن 21 في الرياضة في أيداهو
    القرن 21 في الرياضة في أوهايو
    القرن 21 في الرياضة في أوريغن
    القرن 21 في الرياضة في ألاباما
    القرن 21 في الرياضة في أريزونا
    القرن 21 في الرياضة في أركنساس
    القرن 21 في الرياضة في آيوا
    القرن 20 في الرياضة في ولاية نيويورك
    القرن 20 في الرياضة في ولاية جورجيا
    القرن 20 في الرياضة في وايومنغ
    القرن 20 في الرياضة في نيوجيرسي
    القرن 20 في الرياضة في ميشيغان
    القرن 20 في الرياضة في ميزوري
    القرن 20 في الرياضة في مسيسيبي
    القرن 20 في الرياضة في مدينة نيويورك
    القرن 20 في الرياضة في ماساتشوستس
    القرن 20 في الرياضة في ماريلند
    القرن 20 في الرياضة في لويزيانا
    القرن 20 في الرياضة في كولورادو
    القرن 20 في الرياضة في كاليفورنيا
    القرن 20 في الرياضة في فلوريدا
    القرن 20 في الرياضة في رود آيلاند
    القرن 20 في الرياضة في تكساس
    القرن 20 في الرياضة في بنسيلفانيا
    القرن 20 في الرياضة في إنديانا
    القرن 20 في الرياضة في إلينوي
    القرن 20 في الرياضة في أوهايو
    القرن 20 في الرياضة في أوكلاهوما
    القرن 20 في الرياضة في ألاباما
    القرن 20 في الرياضة في أريزونا
    القرن 20 في الرياضة في آيوا
    القرن 19 في الرياضة في ولاية نيويورك
    القرن 19 في الرياضة في مدينة نيويورك
    القرن 19 في الرياضة في رود آيلاند
    القرن 19 في الرياضة في بنسيلفانيا
    القرن 19 في الرياضة في إلينوي
    2020 في مناطق حضرية في لوس أنجلوس
    2020 في مصارعة المحترفين في فلوريدا
    2020 في مجتمع في مدريد
    2020 في الرياضة في يوتا
    2020 في الرياضة في ويسكونسن
    2020 في الرياضة في ولاية واشنطن
    2020 في الرياضة في ولاية نيويورك
    2020 في الرياضة في ولاية جورجيا
    2020 في الرياضة في وايومنغ
    2020 في الرياضة في واشنطن العاصمة
    2020 في الرياضة في نيومكسيكو
    2020 في الرياضة في نيوجيرسي
    2020 في الرياضة في نيفادا
    2020 في الرياضة في نبراسكا
    2020 في الرياضة في مينيسوتا
    2020 في الرياضة في ميشيغان
    2020 في الرياضة في ميزوري
    2020 في الرياضة في مسيسيبي
    2020 في الرياضة في مدينة نيويورك
    2020 في الرياضة في ماساتشوستس
    2020 في الرياضة في ماريلند
    2020 في الرياضة في لويزيانا
    2020 في الرياضة في كونيتيكت
    2020 في الرياضة في كولورادو
    2020 في الرياضة في كنتاكي
    2020 في الرياضة في كانساس
    2020 في الرياضة في كاليفورنيا
    2020 في الرياضة في كارولاينا الشمالية
    2020 في الرياضة في فلوريدا
    2020 في الرياضة في فرجينيا
    2020 في الرياضة في رود آيلاند
    2020 في الرياضة في تينيسي
    2020 في الرياضة في تكساس
    2020 في الرياضة في بنسيلفانيا
    2020 في الرياضة في إنديانا
    2020 في الرياضة في إلينوي
    2020 في الرياضة في أيداهو
    2020 في الرياضة في أوهايو
    2020 في الرياضة في أوكلاهوما
    2020 في الرياضة في أوريغون
    2020 في الرياضة في أوريغن
    2020 في الرياضة في ألاباما
    2020 في الرياضة في أريزونا
    2020 في الرياضة في آيوا
    2020 في ألعاب رياضية في نيفادا
    2020 في ألعاب رياضية في فلوريدا
    2020 في ألعاب رياضية في تكساس
    2020 في ألعاب رياضية في إلينوي
    2020 في ألعاب رياضية في ألاباما
    2020 في ألعاب رياضية في أركنساس
    2020 في جنوب إفريقيا
    عقد 2010 في جنوب إفريقيا
    القرن 21 في جنوب إفريقيا
    2020 ق م في جنوب إفريقيا
    عقد 2010 ق م في جنوب إفريقيا
    القرن 21 في الأردن
    عقد 1990 في السعودية
    1995 في الإمارات
    القرن 20 في مصر
    القرن 20 ق م في مصر
    عقد 1980 ق م في العراق
    الألفية 1 في اليمن
    2020 في مولدافيا
    آسيا حسب المدينة في القرن 17
    آسيا حسب المدينة في عقد 2020
    أذربيجانيون حسب المهنة في القرن 20
    أشخاص أمريكيون شماليون حسب الجنسية في القرن 17
    1989 في اتحاد الرجبي حسب البلد
    1881 في الرياضة في رود آيلاند
    القرن 19 في الرياضة في رود آيلاند
    هجمات في كندا في عقد 2020
    عقد 2020 في مجتمع في مدريد
    عقد 2020 في مجتمع في مدريد حسب المدينة والبلد
    عقد 2020 حسب المدينة والبلد في مجتمع في مدريد
    القرن 17 في أشخاص أمريكيون شماليون حسب الجنسية
"""
text_list = [x.strip() for x in textx.split("\n")]
# ---
same = []
# ---
n = 0
# ---
for text in text_list:
    n += 1
    text = text.replace("_", " ")
    if not text:
        continue
    new = mv_years.move_years(text)
    if new != text:
        printe.output(f'old: "{text}"')
        printe.output(f'<<green>>new: "{new}"')
        printe.output(f"{n}----------")
    else:
        same.append(text)
# ---
for text in same:
    printe.output(f'same: "{text}"')
